app/controllers/products_controller.rb

SELECT * FROM "products"
---
  def index
    @products = Product.all

SELECT * FROM "products" WHERE ("products"."id" = 1)
---
  def show
    @product = Product.find(params[:id])

SELECT * FROM "products" WHERE ("products"."id" = 2)
---
  def edit
    @product = Product.find(params[:id])

INSERT INTO "products" ("name", "price", "created_at", "photo_file_size", "updated_at", "photo_file_name", "photo_content_type", "description") VALUES('test', 0.0, '2010-03-11 20:47:43', NULL, '2010-03-11 20:47:43', NULL, NULL, 'test')
---
  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save

SELECT * FROM "products" WHERE ("products"."id" = 2)
UPDATE "products" SET "updated_at" = '2010-03-13 12:28:47', "description" = 'description1' WHERE "id" = 2
---
  def update
    @product = Product.find(params[:id])

    respond_to do |format|
      if @product.update_attributes(params[:product])

SELECT * FROM "products" WHERE ("products"."id" = 1)
DELETE FROM "products" WHERE "id" = 1
---
  def destroy
    @product = Product.find(params[:id])
    @product.destroy